# GetPlanarRef

## Description
Get the plane ref ID of the specified object.

```pascal
FUNCTION GetPlanarRef(h : HANDLE): LONGINT;
```

```python
def vs.GetPlanarRef(h):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to the object.|

## Version
Availability: from Vectorworks 2011

## Category
* Object Info